2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
#ifndef __STM8S_TIM1_INLINE_H
#define __STM8S_TIM1_INLINE_H

#include "stm8s_tim1.h"

/**
 * @brief  Configure the TI1 as Input.
 * @param  TIM1_ICPolarity  The Input Polarity.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICPOLARITY_FALLING
 *                       - TIM1_ICPOLARITY_RISING
 * @param  TIM1_ICSelection specifies the input to be used.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICSELECTION_DIRECTTI: TIM1 Input 1 is selected
 * to be connected to IC1.
 *                       - TIM1_ICSELECTION_INDIRECTTI: TIM1 Input 1 is selected
 * to be connected to IC2.
 * @param  TIM1_ICFilter Specifies the Input Capture Filter.
 *         This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
inline void TIM1_TI1_Config_inline(uint8_t TIM1_ICPolarity,
                                   uint8_t TIM1_ICSelection,
                                   uint8_t TIM1_ICFilter) {
  /* Disable the Channel 1: Reset the CCE Bit */
  TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC1E);

  /* Select the Input and set the filter */
  TIM1->CCMR1 =
      (uint8_t)((uint8_t)(TIM1->CCMR1 & (uint8_t)(~(uint8_t)(TIM1_CCMR_CCxS |
                                                             TIM1_CCMR_ICxF))) |
                (uint8_t)(((TIM1_ICSelection)) |
                          ((uint8_t)(TIM1_ICFilter << 4))));

  /* Select the Polarity */
  if (TIM1_ICPolarity != TIM1_ICPOLARITY_RISING) {
    TIM1->CCER1 |= TIM1_CCER1_CC1P;
  } else {
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC1P);
  }

  /* Set the CCE Bit */
  TIM1->CCER1 |= TIM1_CCER1_CC1E;
}

/**
 * @brief  Configure the TI2 as Input.
 * @param  TIM1_ICPolarity  The Input Polarity.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICPOLARITY_FALLING
 *                       - TIM1_ICPOLARITY_RISING
 * @param  TIM1_ICSelection specifies the input to be used.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICSELECTION_DIRECTTI: TIM1 Input 2 is selected
 * to be connected to IC2.
 *                       - TIM1_ICSELECTION_INDIRECTTI: TIM1 Input 2 is selected
 * to be connected to IC1.
 * @param  TIM1_ICFilter Specifies the Input Capture Filter.
 *         This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
inline void TIM1_TI2_Config_inline(uint8_t TIM1_ICPolarity,
                                   uint8_t TIM1_ICSelection,
                                   uint8_t TIM1_ICFilter) {
  /* Disable the Channel 2: Reset the CCE Bit */
  TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2E);

  /* Select the Input and set the filter */
  TIM1->CCMR2 =
      (uint8_t)((uint8_t)(TIM1->CCMR2 & (uint8_t)(~(uint8_t)(TIM1_CCMR_CCxS |
                                                             TIM1_CCMR_ICxF))) |
                (uint8_t)(((TIM1_ICSelection)) |
                          ((uint8_t)(TIM1_ICFilter << 4))));
  /* Select the Polarity */
  if (TIM1_ICPolarity != TIM1_ICPOLARITY_RISING) {
    TIM1->CCER1 |= TIM1_CCER1_CC2P;
  } else {
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2P);
  }
  /* Set the CCE Bit */
  TIM1->CCER1 |= TIM1_CCER1_CC2E;
}

/**
 * @brief  Configure the TI3 as Input.
 * @param  TIM1_ICPolarity  The Input Polarity.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICPOLARITY_FALLING
 *                       - TIM1_ICPOLARITY_RISING
 * @param  TIM1_ICSelection specifies the input to be used.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICSELECTION_DIRECTTI: TIM1 Input 3 is selected
 * to be connected to IC3.
 *                       - TIM1_ICSELECTION_INDIRECTTI: TIM1 Input 3 is selected
 * to be connected to IC4.
 * @param  TIM1_ICFilter Specifies the Input Capture Filter.
 *         This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
inline void TI3_Config_inline(uint8_t TIM1_ICPolarity, uint8_t TIM1_ICSelection,
                              uint8_t TIM1_ICFilter) {
  /* Disable the Channel 3: Reset the CCE Bit */
  TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC3E);

  /* Select the Input and set the filter */
  TIM1->CCMR3 =
      (uint8_t)((uint8_t)(TIM1->CCMR3 & (uint8_t)(~(uint8_t)(TIM1_CCMR_CCxS |
                                                             TIM1_CCMR_ICxF))) |
                (uint8_t)(((TIM1_ICSelection)) |
                          ((uint8_t)(TIM1_ICFilter << 4))));

  /* Select the Polarity */
  if (TIM1_ICPolarity != TIM1_ICPOLARITY_RISING) {
    TIM1->CCER2 |= TIM1_CCER2_CC3P;
  } else {
    TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC3P);
  }
  /* Set the CCE Bit */
  TIM1->CCER2 |= TIM1_CCER2_CC3E;
}

/**
 * @brief  Configure the TI4 as Input.
 * @param  TIM1_ICPolarity  The Input Polarity.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICPOLARITY_FALLING
 *                       - TIM1_ICPOLARITY_RISING
 * @param  TIM1_ICSelection specifies the input to be used.
 *         This parameter can be one of the following values:
 *                       - TIM1_ICSELECTION_DIRECTTI: TIM1 Input 4 is selected
 * to be connected to IC4.
 *                       - TIM1_ICSELECTION_INDIRECTTI: TIM1 Input 4 is selected
 * to be connected to IC3.
 * @param  TIM1_ICFilter Specifies the Input Capture Filter.
 *         This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
inline void TI4_Config_inline(uint8_t TIM1_ICPolarity, uint8_t TIM1_ICSelection,
                              uint8_t TIM1_ICFilter) {
  /* Disable the Channel 4: Reset the CCE Bit */
  TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC4E);

  /* Select the Input and set the filter */
  TIM1->CCMR4 =
      (uint8_t)((uint8_t)(TIM1->CCMR4 & (uint8_t)(~(uint8_t)(TIM1_CCMR_CCxS |
                                                             TIM1_CCMR_ICxF))) |
                (uint8_t)(((TIM1_ICSelection)) |
                          ((uint8_t)(TIM1_ICFilter << 4))));

  /* Select the Polarity */
  if (TIM1_ICPolarity != TIM1_ICPOLARITY_RISING) {
    TIM1->CCER2 |= TIM1_CCER2_CC4P;
  } else {
    TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC4P);
  }

  /* Set the CCE Bit */
  TIM1->CCER2 |= TIM1_CCER2_CC4E;
}

/**
 * @brief  Deinitializes the TIM1 peripheral registers to their default reset
 * values.
 * @param  None
 * @retval None
 */
inline void TIM1_DeInit_inline(void) {
  TIM1->CR1 = TIM1_CR1_RESET_VALUE;
  TIM1->CR2 = TIM1_CR2_RESET_VALUE;
  TIM1->SMCR = TIM1_SMCR_RESET_VALUE;
  TIM1->ETR = TIM1_ETR_RESET_VALUE;
  TIM1->IER = TIM1_IER_RESET_VALUE;
  TIM1->SR2 = TIM1_SR2_RESET_VALUE;
  /* Disable channels */
  TIM1->CCER1 = TIM1_CCER1_RESET_VALUE;
  TIM1->CCER2 = TIM1_CCER2_RESET_VALUE;
  /* Configure channels as inputs: it is necessary if lock level is equal to 2
   * or 3 */
  TIM1->CCMR1 = 0x01;
  TIM1->CCMR2 = 0x01;
  TIM1->CCMR3 = 0x01;
  TIM1->CCMR4 = 0x01;
  /* Then reset channel registers: it also works if lock level is equal to 2 or
   * 3 */
  TIM1->CCER1 = TIM1_CCER1_RESET_VALUE;
  TIM1->CCER2 = TIM1_CCER2_RESET_VALUE;
  TIM1->CCMR1 = TIM1_CCMR1_RESET_VALUE;
  TIM1->CCMR2 = TIM1_CCMR2_RESET_VALUE;
  TIM1->CCMR3 = TIM1_CCMR3_RESET_VALUE;
  TIM1->CCMR4 = TIM1_CCMR4_RESET_VALUE;
  TIM1->CNTRH = TIM1_CNTRH_RESET_VALUE;
  TIM1->CNTRL = TIM1_CNTRL_RESET_VALUE;
  TIM1->PSCRH = TIM1_PSCRH_RESET_VALUE;
  TIM1->PSCRL = TIM1_PSCRL_RESET_VALUE;
  TIM1->ARRH = TIM1_ARRH_RESET_VALUE;
  TIM1->ARRL = TIM1_ARRL_RESET_VALUE;
  TIM1->CCR1H = TIM1_CCR1H_RESET_VALUE;
  TIM1->CCR1L = TIM1_CCR1L_RESET_VALUE;
  TIM1->CCR2H = TIM1_CCR2H_RESET_VALUE;
  TIM1->CCR2L = TIM1_CCR2L_RESET_VALUE;
  TIM1->CCR3H = TIM1_CCR3H_RESET_VALUE;
  TIM1->CCR3L = TIM1_CCR3L_RESET_VALUE;
  TIM1->CCR4H = TIM1_CCR4H_RESET_VALUE;
  TIM1->CCR4L = TIM1_CCR4L_RESET_VALUE;
  TIM1->OISR = TIM1_OISR_RESET_VALUE;
  TIM1->EGR = 0x01; /* TIM1_EGR_UG */
  TIM1->DTR = TIM1_DTR_RESET_VALUE;
  TIM1->BKR = TIM1_BKR_RESET_VALUE;
  TIM1->RCR = TIM1_RCR_RESET_VALUE;
  TIM1->SR1 = TIM1_SR1_RESET_VALUE;
}

/**
 * @brief  Initializes the TIM1 Time Base Unit according to the specified
 * parameters.
 * @param  TIM1_Prescaler specifies the Prescaler value.
 * @param  TIM1_CounterMode specifies the counter mode  from @ref
 * TIM1_CounterMode_TypeDef .
 * @param  TIM1_Period specifies the Period value.
 * @param  TIM1_RepetitionCounter specifies the Repetition counter value
 * @retval None
 */
inline void TIM1_TimeBaseInit_inline(uint16_t TIM1_Prescaler,
                                     TIM1_CounterMode_TypeDef TIM1_CounterMode,
                                     uint16_t TIM1_Period,
                                     uint8_t TIM1_RepetitionCounter) {
  /* Check parameters */
  assert_param(IS_TIM1_COUNTER_MODE_OK(TIM1_CounterMode));

  /* Set the Autoreload value */
  TIM1->ARRH = (uint8_t)(TIM1_Period >> 8);
  TIM1->ARRL = (uint8_t)(TIM1_Period);

