2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
  /* Reset the Output Compare Bits & Set the Output Compare Mode */
  TIM1->CCMR2 = (uint8_t)((uint8_t)(TIM1->CCMR2 & (uint8_t)(~TIM1_CCMR_OCM)) |
                          (uint8_t)TIM1_OCMode);

  /* Reset the Output Idle state & the Output N Idle state bits */
  TIM1->OISR &= (uint8_t)(~(TIM1_OISR_OIS2 | TIM1_OISR_OIS2N));
  /* Set the Output Idle state & the Output N Idle state configuration */
  TIM1->OISR |= (uint8_t)((uint8_t)(TIM1_OISR_OIS2 & TIM1_OCIdleState) |
                          (uint8_t)(TIM1_OISR_OIS2N & TIM1_OCNIdleState));

  /* Set the Pulse value */
  TIM1->CCR2H = (uint8_t)(TIM1_Pulse >> 8);
  TIM1->CCR2L = (uint8_t)(TIM1_Pulse);
}

/**
 * @brief  Initializes the TIM1 Channel3 according to the specified parameters.
 * @param  TIM1_OCMode specifies the Output Compare mode  from
 *         @ref TIM1_OCMode_TypeDef.
 * @param  TIM1_OutputState specifies the Output State
 *         from @ref TIM1_OutputState_TypeDef.
 * @param  TIM1_OutputNState specifies the Complementary Output State
 *         from @ref TIM1_OutputNState_TypeDef.
 * @param  TIM1_Pulse specifies the Pulse width value.
 * @param  TIM1_OCPolarity specifies the Output Compare Polarity  from
 *         @ref TIM1_OCPolarity_TypeDef.
 * @param  TIM1_OCNPolarity specifies the Complementary  Output Compare
 *         Polarity from @ref TIM1_OCNPolarity_TypeDef.
 * @param  TIM1_OCIdleState specifies the Output Compare Idle State
 *         from @ref TIM1_OCIdleState_TypeDef.
 * @param  TIM1_OCNIdleState specifies the Complementary Output Compare
 *         Idle State  from @ref TIM1_OCIdleState_TypeDef.
 * @retval None
 */
inline void TIM1_OC3Init_inline(TIM1_OCMode_TypeDef TIM1_OCMode,
                                TIM1_OutputState_TypeDef TIM1_OutputState,
                                TIM1_OutputNState_TypeDef TIM1_OutputNState,
                                uint16_t TIM1_Pulse,
                                TIM1_OCPolarity_TypeDef TIM1_OCPolarity,
                                TIM1_OCNPolarity_TypeDef TIM1_OCNPolarity,
                                TIM1_OCIdleState_TypeDef TIM1_OCIdleState,
                                TIM1_OCNIdleState_TypeDef TIM1_OCNIdleState) {
  /* Check the parameters */
  assert_param(IS_TIM1_OC_MODE_OK(TIM1_OCMode));
  assert_param(IS_TIM1_OUTPUT_STATE_OK(TIM1_OutputState));
  assert_param(IS_TIM1_OUTPUTN_STATE_OK(TIM1_OutputNState));
  assert_param(IS_TIM1_OC_POLARITY_OK(TIM1_OCPolarity));
  assert_param(IS_TIM1_OCN_POLARITY_OK(TIM1_OCNPolarity));
  assert_param(IS_TIM1_OCIDLE_STATE_OK(TIM1_OCIdleState));
  assert_param(IS_TIM1_OCNIDLE_STATE_OK(TIM1_OCNIdleState));

  /* Disable the Channel 1: Reset the CCE Bit, Set the Output State ,
  the Output N State, the Output Polarity & the Output N Polarity*/
  TIM1->CCER2 &= (uint8_t)(~(TIM1_CCER2_CC3E | TIM1_CCER2_CC3NE |
                             TIM1_CCER2_CC3P | TIM1_CCER2_CC3NP));
  /* Set the Output State & Set the Output N State & Set the Output Polarity &
  Set the Output N Polarity */
  TIM1->CCER2 |=
      (uint8_t)((uint8_t)((uint8_t)(TIM1_OutputState & TIM1_CCER2_CC3E) |
                          (uint8_t)(TIM1_OutputNState & TIM1_CCER2_CC3NE)) |
                (uint8_t)((uint8_t)(TIM1_OCPolarity & TIM1_CCER2_CC3P) |
                          (uint8_t)(TIM1_OCNPolarity & TIM1_CCER2_CC3NP)));

  /* Reset the Output Compare Bits & Set the Output Compare Mode */
  TIM1->CCMR3 = (uint8_t)((uint8_t)(TIM1->CCMR3 & (uint8_t)(~TIM1_CCMR_OCM)) |
                          (uint8_t)TIM1_OCMode);

  /* Reset the Output Idle state & the Output N Idle state bits */
  TIM1->OISR &= (uint8_t)(~(TIM1_OISR_OIS3 | TIM1_OISR_OIS3N));
  /* Set the Output Idle state & the Output N Idle state configuration */
  TIM1->OISR |= (uint8_t)((uint8_t)(TIM1_OISR_OIS3 & TIM1_OCIdleState) |
                          (uint8_t)(TIM1_OISR_OIS3N & TIM1_OCNIdleState));

  /* Set the Pulse value */
  TIM1->CCR3H = (uint8_t)(TIM1_Pulse >> 8);
  TIM1->CCR3L = (uint8_t)(TIM1_Pulse);
}

/**
 * @brief  Initializes the TIM1 Channel4 according to the specified parameters.
 * @param  TIM1_OCMode specifies the Output Compare mode  from
 *         @ref TIM1_OCMode_TypeDef.
 * @param  TIM1_OutputState specifies the Output State
 *         from @ref TIM1_OutputState_TypeDef.
 * @param  TIM1_Pulse specifies the Pulse width  value.
 * @param  TIM1_OCPolarity specifies the Output Compare Polarity
 *         from @ref TIM1_OCPolarity_TypeDef.
 * @param  TIM1_OCIdleState specifies the Output Compare Idle State
 *         from @ref TIM1_OCIdleState_TypeDef.
 * @retval None
 */
inline void TIM1_OC4Init_inline(TIM1_OCMode_TypeDef TIM1_OCMode,
                                TIM1_OutputState_TypeDef TIM1_OutputState,
                                uint16_t TIM1_Pulse,
                                TIM1_OCPolarity_TypeDef TIM1_OCPolarity,
                                TIM1_OCIdleState_TypeDef TIM1_OCIdleState) {
  /* Check the parameters */
  assert_param(IS_TIM1_OC_MODE_OK(TIM1_OCMode));
  assert_param(IS_TIM1_OUTPUT_STATE_OK(TIM1_OutputState));
  assert_param(IS_TIM1_OC_POLARITY_OK(TIM1_OCPolarity));
  assert_param(IS_TIM1_OCIDLE_STATE_OK(TIM1_OCIdleState));

  /* Disable the Channel 4: Reset the CCE Bit */
  TIM1->CCER2 &= (uint8_t)(~(TIM1_CCER2_CC4E | TIM1_CCER2_CC4P));
  /* Set the Output State  &  the Output Polarity */
  TIM1->CCER2 |= (uint8_t)((uint8_t)(TIM1_OutputState & TIM1_CCER2_CC4E) |
                           (uint8_t)(TIM1_OCPolarity & TIM1_CCER2_CC4P));

  /* Reset the Output Compare Bit  and Set the Output Compare Mode */
  TIM1->CCMR4 = (uint8_t)((uint8_t)(TIM1->CCMR4 & (uint8_t)(~TIM1_CCMR_OCM)) |
                          TIM1_OCMode);

  /* Set the Output Idle state */
  if (TIM1_OCIdleState != TIM1_OCIDLESTATE_RESET) {
    TIM1->OISR |= (uint8_t)(~TIM1_CCER2_CC4P);
  } else {
    TIM1->OISR &= (uint8_t)(~TIM1_OISR_OIS4);
  }

  /* Set the Pulse value */
  TIM1->CCR4H = (uint8_t)(TIM1_Pulse >> 8);
  TIM1->CCR4L = (uint8_t)(TIM1_Pulse);
}

/**
 * @brief  Configures the Break feature, dead time, Lock level, the OSSI,
 *         and the AOE(automatic output enable).
 * @param  TIM1_OSSIState specifies the OSSIS State from @ref
 * TIM1_OSSIState_TypeDef.
 * @param  TIM1_LockLevel specifies the lock level from @ref
 * TIM1_LockLevel_TypeDef.
 * @param  TIM1_DeadTime specifies the dead time value.
 * @param  TIM1_Break specifies the Break state @ref TIM1_BreakState_TypeDef.
 * @param  TIM1_BreakPolarity specifies the Break polarity from
 *         @ref TIM1_BreakPolarity_TypeDef.
 * @param  TIM1_AutomaticOutput specifies the Automatic Output configuration
 *         from @ref TIM1_AutomaticOutput_TypeDef.
 * @retval None
 */
inline void
TIM1_BDTRConfig_inline(TIM1_OSSIState_TypeDef TIM1_OSSIState,
                       TIM1_LockLevel_TypeDef TIM1_LockLevel,
                       uint8_t TIM1_DeadTime,
                       TIM1_BreakState_TypeDef TIM1_Break,
                       TIM1_BreakPolarity_TypeDef TIM1_BreakPolarity,
                       TIM1_AutomaticOutput_TypeDef TIM1_AutomaticOutput) {
  /* Check the parameters */
  assert_param(IS_TIM1_OSSI_STATE_OK(TIM1_OSSIState));
  assert_param(IS_TIM1_LOCK_LEVEL_OK(TIM1_LockLevel));
  assert_param(IS_TIM1_BREAK_STATE_OK(TIM1_Break));
  assert_param(IS_TIM1_BREAK_POLARITY_OK(TIM1_BreakPolarity));
  assert_param(IS_TIM1_AUTOMATIC_OUTPUT_STATE_OK(TIM1_AutomaticOutput));

