2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
  TIM1->DTR = (uint8_t)(TIM1_DeadTime);
  /* Set the Lock level, the Break enable Bit and the Polarity, the OSSI State,
  the dead time value  and the Automatic Output Enable Bit */

  TIM1->BKR =
      (uint8_t)((uint8_t)(TIM1_OSSIState | (uint8_t)TIM1_LockLevel) |
                (uint8_t)((uint8_t)(TIM1_Break | (uint8_t)TIM1_BreakPolarity) |
                          (uint8_t)TIM1_AutomaticOutput));
}

inline void TIM1_SetIC1Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC1Prescaler);
inline void TIM1_SetIC3Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC3Prescaler);
inline void TIM1_SetIC2Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC2Prescaler);
inline void TIM1_SetIC4Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC4Prescaler);

/**
 * @brief  Initializes the TIM1 peripheral according to the specified
 * parameters.
 * @param  TIM1_Channel specifies the input capture channel from
 * TIM1_Channel_TypeDef.
 * @param  TIM1_ICPolarity specifies the Input capture polarity from
 *         TIM1_ICPolarity_TypeDef .
 * @param  TIM1_ICSelection specifies the Input capture source selection from
 *         TIM1_ICSelection_TypeDef.
 * @param  TIM1_ICPrescaler specifies the Input capture Prescaler from
 *         TIM1_ICPSC_TypeDef.
 * @param  TIM1_ICFilter specifies the Input capture filter value.
 * @retval None
 */
inline void TIM1_ICInit_inline(TIM1_Channel_TypeDef TIM1_Channel,
                               TIM1_ICPolarity_TypeDef TIM1_ICPolarity,
                               TIM1_ICSelection_TypeDef TIM1_ICSelection,
                               TIM1_ICPSC_TypeDef TIM1_ICPrescaler,
                               uint8_t TIM1_ICFilter) {
  /* Check the parameters */
  assert_param(IS_TIM1_CHANNEL_OK(TIM1_Channel));
  assert_param(IS_TIM1_IC_POLARITY_OK(TIM1_ICPolarity));
  assert_param(IS_TIM1_IC_SELECTION_OK(TIM1_ICSelection));
  assert_param(IS_TIM1_IC_PRESCALER_OK(TIM1_ICPrescaler));
  assert_param(IS_TIM1_IC_FILTER_OK(TIM1_ICFilter));

  if (TIM1_Channel == TIM1_CHANNEL_1) {
    /* TI1 Configuration */
    TIM1_TI1_Config_inline((uint8_t)TIM1_ICPolarity, (uint8_t)TIM1_ICSelection,
                           (uint8_t)TIM1_ICFilter);
    /* Set the Input Capture Prescaler value */
    TIM1_SetIC1Prescaler_inline(TIM1_ICPrescaler);
  } else if (TIM1_Channel == TIM1_CHANNEL_2) {
    /* TI2 Configuration */
    TIM1_TI2_Config_inline((uint8_t)TIM1_ICPolarity, (uint8_t)TIM1_ICSelection,
                           (uint8_t)TIM1_ICFilter);
    /* Set the Input Capture Prescaler value */
    TIM1_SetIC2Prescaler_inline(TIM1_ICPrescaler);
  } else if (TIM1_Channel == TIM1_CHANNEL_3) {
    /* TI3 Configuration */
    TI3_Config_inline((uint8_t)TIM1_ICPolarity, (uint8_t)TIM1_ICSelection,
                      (uint8_t)TIM1_ICFilter);
    /* Set the Input Capture Prescaler value */
    TIM1_SetIC3Prescaler_inline(TIM1_ICPrescaler);
  } else {
    /* TI4 Configuration */
    TI4_Config_inline((uint8_t)TIM1_ICPolarity, (uint8_t)TIM1_ICSelection,
                      (uint8_t)TIM1_ICFilter);
    /* Set the Input Capture Prescaler value */
    TIM1_SetIC4Prescaler_inline(TIM1_ICPrescaler);
  }
}

/**
 * @brief  Configures the TIM1 peripheral in PWM Input Mode according to the
 *         specified parameters.
 * @param  TIM1_Channel specifies the input capture channel from
 *         @ref TIM1_Channel_TypeDef.
 * @param  TIM1_ICPolarity specifies the Input capture polarity from
 *         @ref TIM1_ICPolarity_TypeDef .
 * @param  TIM1_ICSelection specifies the Input capture source selection  from
 *         @ref TIM1_ICSelection_TypeDef.
 * @param  TIM1_ICPrescaler specifies the Input capture Prescaler from
 *         @ref TIM1_ICPSC_TypeDef.
 * @param  TIM1_ICFilter specifies the Input capture filter value.
 * @retval None
 */
inline void TIM1_PWMIConfig_inline(TIM1_Channel_TypeDef TIM1_Channel,
                                   TIM1_ICPolarity_TypeDef TIM1_ICPolarity,
                                   TIM1_ICSelection_TypeDef TIM1_ICSelection,
                                   TIM1_ICPSC_TypeDef TIM1_ICPrescaler,
                                   uint8_t TIM1_ICFilter) {
  uint8_t icpolarity = TIM1_ICPOLARITY_RISING;
  uint8_t icselection = TIM1_ICSELECTION_DIRECTTI;

  /* Check the parameters */
  assert_param(IS_TIM1_PWMI_CHANNEL_OK(TIM1_Channel));
  assert_param(IS_TIM1_IC_POLARITY_OK(TIM1_ICPolarity));
  assert_param(IS_TIM1_IC_SELECTION_OK(TIM1_ICSelection));
  assert_param(IS_TIM1_IC_PRESCALER_OK(TIM1_ICPrescaler));

  /* Select the Opposite Input Polarity */
  if (TIM1_ICPolarity != TIM1_ICPOLARITY_FALLING) {
    icpolarity = TIM1_ICPOLARITY_FALLING;
  } else {
    icpolarity = TIM1_ICPOLARITY_RISING;
  }

  /* Select the Opposite Input */
  if (TIM1_ICSelection == TIM1_ICSELECTION_DIRECTTI) {
    icselection = TIM1_ICSELECTION_INDIRECTTI;
  } else {
    icselection = TIM1_ICSELECTION_DIRECTTI;
  }

  if (TIM1_Channel == TIM1_CHANNEL_1) {
    /* TI1 Configuration */
    TIM1_TI1_Config_inline((uint8_t)TIM1_ICPolarity, (uint8_t)TIM1_ICSelection,
                           (uint8_t)TIM1_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM1_SetIC1Prescaler_inline(TIM1_ICPrescaler);

    /* TI2 Configuration */
    TIM1_TI2_Config_inline(icpolarity, icselection, TIM1_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM1_SetIC2Prescaler_inline(TIM1_ICPrescaler);
  } else {
    /* TI2 Configuration */
    TIM1_TI2_Config_inline((uint8_t)TIM1_ICPolarity, (uint8_t)TIM1_ICSelection,
                           (uint8_t)TIM1_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM1_SetIC2Prescaler_inline(TIM1_ICPrescaler);

    /* TI1 Configuration */
    TIM1_TI1_Config_inline(icpolarity, icselection, TIM1_ICFilter);

    /* Set the Input Capture Prescaler value */
    TIM1_SetIC1Prescaler_inline(TIM1_ICPrescaler);
  }
}

/**
 * @brief  Enables or disables the TIM1 peripheral.
 * @param  NewState new state of the TIM1 peripheral.
 *         This parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM1_Cmd_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* set or Reset the CEN Bit */
  if (NewState != DISABLE) {
    TIM1->CR1 |= TIM1_CR1_CEN;
  } else {
    TIM1->CR1 &= (uint8_t)(~TIM1_CR1_CEN);
  }
}

/**
 * @brief  Enables or disables the TIM1 peripheral Main Outputs.
 * @param  NewState new state of the TIM1 peripheral.
 *         This parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM1_CtrlPWMOutputs_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the MOE Bit */

