2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
  if (NewState != DISABLE) {
    TIM1->BKR |= TIM1_BKR_MOE;
  } else {
    TIM1->BKR &= (uint8_t)(~TIM1_BKR_MOE);
  }
}

/**
 * @brief  Enables or disables the specified TIM1 interrupts.
 * @param  NewState new state of the TIM1 peripheral.
 *         This parameter can be: ENABLE or DISABLE.
 * @param  TIM1_IT specifies the TIM1 interrupts sources to be enabled or
 * disabled. This parameter can be any combination of the following values:
 *           - TIM1_IT_UPDATE: TIM1 update Interrupt source
 *           - TIM1_IT_CC1: TIM1 Capture Compare 1 Interrupt source
 *           - TIM1_IT_CC2: TIM1 Capture Compare 2 Interrupt source
 *           - TIM1_IT_CC3: TIM1 Capture Compare 3 Interrupt source
 *           - TIM1_IT_CC4: TIM1 Capture Compare 4 Interrupt source
 *           - TIM1_IT_CCUpdate: TIM1 Capture Compare Update Interrupt source
 *           - TIM1_IT_TRIGGER: TIM1 Trigger Interrupt source
 *           - TIM1_IT_BREAK: TIM1 Break Interrupt source
 * @param  NewState new state of the TIM1 peripheral.
 * @retval None
 */
inline void TIM1_ITConfig_inline(TIM1_IT_TypeDef TIM1_IT,
                                 FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_TIM1_IT_OK(TIM1_IT));
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (NewState != DISABLE) {
    /* Enable the Interrupt sources */
    TIM1->IER |= (uint8_t)TIM1_IT;
  } else {
    /* Disable the Interrupt sources */
    TIM1->IER &= (uint8_t)(~(uint8_t)TIM1_IT);
  }
}

/**
 * @brief  Configures the TIM1 internal Clock.
 * @param  None
 * @retval None
 */
inline void TIM1_InternalClockConfig_inline(void) {
  /* Disable slave mode to clock the prescaler directly with the internal clock
   */
  TIM1->SMCR &= (uint8_t)(~TIM1_SMCR_SMS);
}

inline void
TIM1_ETRConfig_inline(TIM1_ExtTRGPSC_TypeDef TIM1_ExtTRGPrescaler,
                      TIM1_ExtTRGPolarity_TypeDef TIM1_ExtTRGPolarity,
                      uint8_t ExtTRGFilter);

/**
 * @brief  Configures the TIM1 External clock Mode1.
 * @param  TIM1_ExtTRGPrescaler specifies the external Trigger Prescaler.
 *         This parameter can be one of the following values:
 *                       - TIM1_EXTTRGPSC_OFF
 *                       - TIM1_EXTTRGPSC_DIV2
 *                       - TIM1_EXTTRGPSC_DIV4
 *                       - TIM1_EXTTRGPSC_DIV8.
 * @param  TIM1_ExtTRGPolarity specifies the external Trigger Polarity.
 *         This parameter can be one of the following values:
 *                       - TIM1_EXTTRGPOLARITY_INVERTED
 *                       - TIM1_EXTTRGPOLARITY_NONINVERTED
 * @param  ExtTRGFilter specifies the External Trigger Filter.
 *         This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
inline void
TIM1_ETRClockMode1Config_inline(TIM1_ExtTRGPSC_TypeDef TIM1_ExtTRGPrescaler,
                                TIM1_ExtTRGPolarity_TypeDef TIM1_ExtTRGPolarity,
                                uint8_t ExtTRGFilter) {
  /* Check the parameters */
  assert_param(IS_TIM1_EXT_PRESCALER_OK(TIM1_ExtTRGPrescaler));
  assert_param(IS_TIM1_EXT_POLARITY_OK(TIM1_ExtTRGPolarity));

  /* Configure the ETR Clock source */
  TIM1_ETRConfig_inline(TIM1_ExtTRGPrescaler, TIM1_ExtTRGPolarity,
                        ExtTRGFilter);

  /* Select the External clock mode1 & Select the Trigger selection : ETRF */
  TIM1->SMCR =
      (uint8_t)((uint8_t)(TIM1->SMCR &
                          (uint8_t)(~(uint8_t)(TIM1_SMCR_SMS | TIM1_SMCR_TS))) |
                (uint8_t)((uint8_t)TIM1_SLAVEMODE_EXTERNAL1 | TIM1_TS_ETRF));
}

/**
 * @brief  Configures the TIM1 External clock Mode2.
 * @param  TIM1_ExtTRGPrescaler specifies the external Trigger Prescaler.
 *         This parameter can be one of the following values:
 *                       - TIM1_EXTTRGPSC_OFF
 *                       - TIM1_EXTTRGPSC_DIV2
 *                       - TIM1_EXTTRGPSC_DIV4
 *                       - TIM1_EXTTRGPSC_DIV8.
 * @param  TIM1_ExtTRGPolarity specifies the external Trigger Polarity.
 *         This parameter can be one of the following values:
 *                       - TIM1_EXTTRGPOLARITY_INVERTED
 *                       - TIM1_EXTTRGPOLARITY_NONINVERTED
 * @param  ExtTRGFilter specifies the External Trigger Filter.
 *         This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
inline void
TIM1_ETRClockMode2Config_inline(TIM1_ExtTRGPSC_TypeDef TIM1_ExtTRGPrescaler,
                                TIM1_ExtTRGPolarity_TypeDef TIM1_ExtTRGPolarity,
                                uint8_t ExtTRGFilter) {
  /* Check the parameters */
  assert_param(IS_TIM1_EXT_PRESCALER_OK(TIM1_ExtTRGPrescaler));
  assert_param(IS_TIM1_EXT_POLARITY_OK(TIM1_ExtTRGPolarity));

  /* Configure the ETR Clock source */
  TIM1_ETRConfig_inline(TIM1_ExtTRGPrescaler, TIM1_ExtTRGPolarity,
                        ExtTRGFilter);

  /* Enable the External clock mode2 */
  TIM1->ETR |= TIM1_ETR_ECE;
}

/**
 * @brief  Configures the TIM1 External Trigger.
 * @param  TIM1_ExtTRGPrescaler specifies the external Trigger Prescaler.
 *         This parameter can be one of the following values:
 *                       - TIM1_EXTTRGPSC_OFF
 *                       - TIM1_EXTTRGPSC_DIV2
 *                       - TIM1_EXTTRGPSC_DIV4
 *                       - TIM1_EXTTRGPSC_DIV8.
 * @param  TIM1_ExtTRGPolarity specifies the external Trigger Polarity.
 *         This parameter can be one of the following values:
 *                       - TIM1_EXTTRGPOLARITY_INVERTED
 *                       - TIM1_EXTTRGPOLARITY_NONINVERTED
 * @param  ExtTRGFilter specifies the External Trigger Filter.
 *         This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
inline void
TIM1_ETRConfig_inline(TIM1_ExtTRGPSC_TypeDef TIM1_ExtTRGPrescaler,
                      TIM1_ExtTRGPolarity_TypeDef TIM1_ExtTRGPolarity,
                      uint8_t ExtTRGFilter) {
  /* Check the parameters */
  assert_param(IS_TIM1_EXT_TRG_FILTER_OK(ExtTRGFilter));
  /* Set the Prescaler, the Filter value and the Polarity */
  TIM1->ETR |=
      (uint8_t)((uint8_t)(TIM1_ExtTRGPrescaler | (uint8_t)TIM1_ExtTRGPolarity) |
                (uint8_t)ExtTRGFilter);
}

inline void
TIM1_SelectInputTrigger_inline(TIM1_TS_TypeDef TIM1_InputTriggerSource);

/**
 * @brief  Configures the TIM1 Trigger as External Clock.
 * @param  TIM1_TIxExternalCLKSource specifies Trigger source.
 *         This parameter can be one of the following values:
 *                     - TIM1_TIXEXTERNALCLK1SOURCE_TI1: TI1 Edge Detector
 *                     - TIM1_TIXEXTERNALCLK1SOURCE_TI2: Filtered TIM1 Input 1
 *                     - TIM1_TIXEXTERNALCLK1SOURCE_TI1ED: Filtered TIM1 Input 2
 * @param  TIM1_ICPolarity specifies the TIx Polarity.
 *         This parameter can be:
 *                     - TIM1_ICPOLARITY_RISING
 *                     - TIM1_ICPOLARITY_FALLING
 * @param  ICFilter specifies the filter value.
 *         This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
inline void TIM1_TIxExternalClockConfig_inline(
    TIM1_TIxExternalCLK1Source_TypeDef TIM1_TIxExternalCLKSource,
    TIM1_ICPolarity_TypeDef TIM1_ICPolarity, uint8_t ICFilter) {
  /* Check the parameters */
  assert_param(IS_TIM1_TIXCLK_SOURCE_OK(TIM1_TIxExternalCLKSource));
  assert_param(IS_TIM1_IC_POLARITY_OK(TIM1_ICPolarity));
  assert_param(IS_TIM1_IC_FILTER_OK(ICFilter));

  /* Configure the TIM1 Input Clock Source */
  if (TIM1_TIxExternalCLKSource == TIM1_TIXEXTERNALCLK1SOURCE_TI2) {
    TIM1_TI2_Config_inline((uint8_t)TIM1_ICPolarity,
                           (uint8_t)TIM1_ICSELECTION_DIRECTTI,
                           (uint8_t)ICFilter);
  } else {
    TIM1_TI1_Config_inline((uint8_t)TIM1_ICPolarity,
                           (uint8_t)TIM1_ICSELECTION_DIRECTTI,
                           (uint8_t)ICFilter);
  }

  /* Select the Trigger source */
  TIM1_SelectInputTrigger_inline((TIM1_TS_TypeDef)TIM1_TIxExternalCLKSource);

  /* Select the External clock mode1 */
  TIM1->SMCR |= (uint8_t)(TIM1_SLAVEMODE_EXTERNAL1);
}

/**
 * @brief  Selects the TIM1 Input Trigger source.
 * @param   TIM1_InputTriggerSource specifies Input Trigger source.
 * This parameter can be one of the following values:
 *                       - TIM1_TS_TI1F_ED: TI1 Edge Detector
 *                       - TIM1_TS_TI1FP1: Filtered Timer Input 1
 *                       - TIM1_TS_TI2FP2: Filtered Timer Input 2
 *                       - TIM1_TS_ETRF: External Trigger input
 * @retval None
 */
inline void
TIM1_SelectInputTrigger_inline(TIM1_TS_TypeDef TIM1_InputTriggerSource) {
  /* Check the parameters */
  assert_param(IS_TIM1_TRIGGER_SELECTION_OK(TIM1_InputTriggerSource));

  /* Select the Tgigger Source */
  TIM1->SMCR = (uint8_t)((uint8_t)(TIM1->SMCR & (uint8_t)(~TIM1_SMCR_TS)) |
                         (uint8_t)TIM1_InputTriggerSource);
}

/**
 * @brief  Enables or Disables the TIM1 Update event.
 * @param   NewState new state of the TIM1 peripheral Preload register. This
 * parameter can be ENABLE or DISABLE.
 * @retval None
 */

inline void TIM1_UpdateDisableConfig_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the UDIS Bit */
  if (NewState != DISABLE) {
    TIM1->CR1 |= TIM1_CR1_UDIS;
  } else {
    TIM1->CR1 &= (uint8_t)(~TIM1_CR1_UDIS);
  }
}

/**
 * @brief  Selects the TIM1 Update Request Interrupt source.
 * @param   TIM1_UpdateSource specifies the Update source.
 * This parameter can be one of the following values
 *                       - TIM1_UPDATESOURCE_REGULAR
 *                       - TIM1_UPDATESOURCE_GLOBAL
 * @retval None
 */
inline void
TIM1_UpdateRequestConfig_inline(TIM1_UpdateSource_TypeDef TIM1_UpdateSource) {
  /* Check the parameters */
  assert_param(IS_TIM1_UPDATE_SOURCE_OK(TIM1_UpdateSource));

  /* Set or Reset the URS Bit */
  if (TIM1_UpdateSource != TIM1_UPDATESOURCE_GLOBAL) {
    TIM1->CR1 |= TIM1_CR1_URS;
  } else {
    TIM1->CR1 &= (uint8_t)(~TIM1_CR1_URS);
  }
}

/**
 * @brief  Enables or Disables the TIM1’s Hall sensor interface.
 * @param   NewState new state of the TIM1 Hall sensor interface.This parameter
 * can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM1_SelectHallSensor_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the TI1S Bit */
  if (NewState != DISABLE) {
    TIM1->CR2 |= TIM1_CR2_TI1S;
  } else {
    TIM1->CR2 &= (uint8_t)(~TIM1_CR2_TI1S);
  }
}

/**
 * @brief  Selects the TIM1’s One Pulse Mode.
 * @param   TIM1_OPMode specifies the OPM Mode to be used.
 * This parameter can be one of the following values
 *                    - TIM1_OPMODE_SINGLE
 *                    - TIM1_OPMODE_REPETITIVE
 * @retval None
 */
inline void TIM1_SelectOnePulseMode_inline(TIM1_OPMode_TypeDef TIM1_OPMode) {
  /* Check the parameters */
  assert_param(IS_TIM1_OPM_MODE_OK(TIM1_OPMode));

  /* Set or Reset the OPM Bit */
  if (TIM1_OPMode != TIM1_OPMODE_REPETITIVE) {
    TIM1->CR1 |= TIM1_CR1_OPM;
  } else {
    TIM1->CR1 &= (uint8_t)(~TIM1_CR1_OPM);
  }
}

/**
 * @brief  Selects the TIM1 Trigger Output Mode.
 * @param   TIM1_TRGOSource specifies the Trigger Output source.
 * This parameter can be one of the following values
 *                       - TIM1_TRGOSOURCE_RESET
 *                       - TIM1_TRGOSOURCE_ENABLE
 *                       - TIM1_TRGOSOURCE_UPDATE
 *                       - TIM1_TRGOSource_OC1
 *                       - TIM1_TRGOSOURCE_OC1REF
 *                       - TIM1_TRGOSOURCE_OC2REF
 *                       - TIM1_TRGOSOURCE_OC3REF
 * @retval None
 */
inline void
TIM1_SelectOutputTrigger_inline(TIM1_TRGOSource_TypeDef TIM1_TRGOSource) {
  /* Check the parameters */
  assert_param(IS_TIM1_TRGO_SOURCE_OK(TIM1_TRGOSource));

  /* Reset the MMS Bits & Select the TRGO source */
  TIM1->CR2 = (uint8_t)((uint8_t)(TIM1->CR2 & (uint8_t)(~TIM1_CR2_MMS)) |
                        (uint8_t)TIM1_TRGOSource);
}

/**
 * @brief  Selects the TIM1 Slave Mode.
 * @param   TIM1_SlaveMode specifies the TIM1 Slave Mode.
 * This parameter can be one of the following values
 *                       - TIM1_SLAVEMODE_RESET
 *                       - TIM1_SLAVEMODE_GATED
 *                       - TIM1_SLAVEMODE_TRIGGER
 *                       - TIM1_SLAVEMODE_EXTERNAL1
 * @retval None
 */
inline void TIM1_SelectSlaveMode_inline(TIM1_SlaveMode_TypeDef TIM1_SlaveMode) {
  /* Check the parameters */
  assert_param(IS_TIM1_SLAVE_MODE_OK(TIM1_SlaveMode));

