2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
  /* Reset the SMS Bits */ /* Select the Slave Mode */
  TIM1->SMCR = (uint8_t)((uint8_t)(TIM1->SMCR & (uint8_t)(~TIM1_SMCR_SMS)) |
                         (uint8_t)TIM1_SlaveMode);
}

/**
 * @brief  Sets or Resets the TIM1 Master/Slave Mode.
 * @param   NewState new state of the synchronization between TIM1 and its
 * slaves (through TRGO). This parameter can be ENABLE or DISABLE.
 * @retval None
 */
inline void TIM1_SelectMasterSlaveMode_inline(FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  /* Set or Reset the MSM Bit */
  if (NewState != DISABLE) {
    TIM1->SMCR |= TIM1_SMCR_MSM;
  } else {
    TIM1->SMCR &= (uint8_t)(~TIM1_SMCR_MSM);
  }
}

/**
 * @brief  Configures the TIM1 Encoder Interface.
 * @param   TIM1_EncoderMode specifies the TIM1 Encoder Mode.
 * This parameter can be one of the following values
 * - TIM1_ENCODERMODE_TI1: Counter counts on TI1FP1 edge
 * depending on TI2FP2 level.
 * - TIM1_ENCODERMODE_TI2: Counter counts on TI2FP2 edge
 *	depending on TI1FP1 level.
 * - TIM1_ENCODERMODE_TI12: Counter counts on both TI1FP1 and
 * TI2FP2 edges depending on the level of the other input.
 * @param   TIM1_IC1Polarity specifies the IC1 Polarity.
 * This parameter can be one of the following values
 *                       - TIM1_ICPOLARITY_FALLING
 *                       - TIM1_ICPOLARITY_RISING
 * @param   TIM1_IC2Polarity specifies the IC2 Polarity.
 * This parameter can be one of the following values
 *                       - TIM1_ICPOLARITY_FALLING
 *                       - TIM1_ICPOLARITY_RISING
 * @retval None
 */
inline void
TIM1_EncoderInterfaceConfig_inline(TIM1_EncoderMode_TypeDef TIM1_EncoderMode,
                                   TIM1_ICPolarity_TypeDef TIM1_IC1Polarity,
                                   TIM1_ICPolarity_TypeDef TIM1_IC2Polarity) {
  /* Check the parameters */
  assert_param(IS_TIM1_ENCODER_MODE_OK(TIM1_EncoderMode));
  assert_param(IS_TIM1_IC_POLARITY_OK(TIM1_IC1Polarity));
  assert_param(IS_TIM1_IC_POLARITY_OK(TIM1_IC2Polarity));

  /* Set the TI1 and the TI2 Polarities */
  if (TIM1_IC1Polarity != TIM1_ICPOLARITY_RISING) {
    TIM1->CCER1 |= TIM1_CCER1_CC1P;
  } else {
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC1P);
  }

  if (TIM1_IC2Polarity != TIM1_ICPOLARITY_RISING) {
    TIM1->CCER1 |= TIM1_CCER1_CC2P;
  } else {
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2P);
  }
  /* Set the encoder Mode */
  TIM1->SMCR = (uint8_t)((uint8_t)(TIM1->SMCR &
                                   (uint8_t)(TIM1_SMCR_MSM | TIM1_SMCR_TS)) |
                         (uint8_t)TIM1_EncoderMode);

  /* Select the Capture Compare 1 and the Capture Compare 2 as input */
  TIM1->CCMR1 = (uint8_t)((uint8_t)(TIM1->CCMR1 & (uint8_t)(~TIM1_CCMR_CCxS)) |
                          (uint8_t)CCMR_TIxDirect_Set);
  TIM1->CCMR2 = (uint8_t)((uint8_t)(TIM1->CCMR2 & (uint8_t)(~TIM1_CCMR_CCxS)) |
                          (uint8_t)CCMR_TIxDirect_Set);
}

/**
 * @brief  Configures the TIM1 Prescaler.
 * @param   Prescaler specifies the Prescaler Register value
 * This parameter must be a value between 0x0000 and 0xFFFF
 * @param   TIM1_PSCReloadMode specifies the TIM1 Prescaler Reload mode.
 * This parameter can be one of the following values
 * - TIM1_PSCRELOADMODE_IMMEDIATE: The Prescaler is loaded immediately.
 * - TIM1_PSCRELOADMODE_UPDATE: The Prescaler is loaded at the update event.
 * @retval None
 */
inline void
TIM1_PrescalerConfig_inline(uint16_t Prescaler,
                            TIM1_PSCReloadMode_TypeDef TIM1_PSCReloadMode) {
  /* Check the parameters */
  assert_param(IS_TIM1_PRESCALER_RELOAD_OK(TIM1_PSCReloadMode));

  /* Set the Prescaler value */
  TIM1->PSCRH = (uint8_t)(Prescaler >> 8);
  TIM1->PSCRL = (uint8_t)(Prescaler);

  /* Set or reset the UG Bit */
  TIM1->EGR = (uint8_t)TIM1_PSCReloadMode;
}

/**
 * @brief  Specifies the TIM1 Counter Mode to be used.
 * @param   TIM1_CounterMode specifies the Counter Mode to be used
 * This parameter can be one of the following values:
 * - TIM1_COUNTERMODE_UP: TIM1 Up Counting Mode
 * - TIM1_COUNTERMODE_DOWN: TIM1 Down Counting Mode
 * - TIM1_COUNTERMODE_CENTERALIGNED1: TIM1 Center Aligned Mode1
 * - TIM1_CounterMode_CenterAligned2: TIM1 Center Aligned Mode2
 * - TIM1_COUNTERMODE_CENTERALIGNED3: TIM1 Center Aligned Mode3
 * @retval None
 */
inline void
TIM1_CounterModeConfig_inline(TIM1_CounterMode_TypeDef TIM1_CounterMode) {
  /* Check the parameters */
  assert_param(IS_TIM1_COUNTER_MODE_OK(TIM1_CounterMode));

  /* Reset the CMS and DIR Bits & Set the Counter Mode */
  TIM1->CR1 =
      (uint8_t)((uint8_t)(TIM1->CR1 & (uint8_t)((uint8_t)(~TIM1_CR1_CMS) &
                                                (uint8_t)(~TIM1_CR1_DIR))) |
                (uint8_t)TIM1_CounterMode);
}

/**
 * @brief  Forces the TIM1 Channel1 output waveform to active or inactive level.
 * @param   TIM1_ForcedAction specifies the forced Action to be set to the
 * output waveform. This parameter can be one of the following values:
 * - TIM1_FORCEDACTION_ACTIVE: Force active level on OC1REF
 * - TIM1_FORCEDACTION_INACTIVE: Force inactive level on OC1REF.
 * @retval None
 */
inline void
TIM1_ForcedOC1Config_inline(TIM1_ForcedAction_TypeDef TIM1_ForcedAction) {
  /* Check the parameters */
  assert_param(IS_TIM1_FORCED_ACTION_OK(TIM1_ForcedAction));

  /* Reset the OCM Bits & Configure the Forced output Mode */
  TIM1->CCMR1 = (uint8_t)((uint8_t)(TIM1->CCMR1 & (uint8_t)(~TIM1_CCMR_OCM)) |
                          (uint8_t)TIM1_ForcedAction);
}

/**
 * @brief  Forces the TIM1 Channel2 output waveform to active or inactive level.
 * @param   TIM1_ForcedAction specifies the forced Action to be set to the
 * output waveform. This parameter can be one of the following values:
 * - TIM1_FORCEDACTION_ACTIVE: Force active level on OC2REF
 * - TIM1_FORCEDACTION_INACTIVE: Force inactive level on OC2REF.
 * @retval None
 */
inline void
TIM1_ForcedOC2Config_inline(TIM1_ForcedAction_TypeDef TIM1_ForcedAction) {
  /* Check the parameters */
  assert_param(IS_TIM1_FORCED_ACTION_OK(TIM1_ForcedAction));

  /* Reset the OCM Bits & Configure the Forced output Mode */
  TIM1->CCMR2 = (uint8_t)((uint8_t)(TIM1->CCMR2 & (uint8_t)(~TIM1_CCMR_OCM)) |
                          (uint8_t)TIM1_ForcedAction);
}

/**
 * @brief  Forces the TIM1 Channel3 output waveform to active or inactive level.
 * @param   TIM1_ForcedAction specifies the forced Action to be set to the
 * output waveform. This parameter can be one of the following values:
 *                       - TIM1_FORCEDACTION_ACTIVE: Force active level on
 * OC3REF
 *                       - TIM1_FORCEDACTION_INACTIVE: Force inactive level on
 *                         OC3REF.
 * @retval None
 */
inline void
TIM1_ForcedOC3Config_inline(TIM1_ForcedAction_TypeDef TIM1_ForcedAction) {
  /* Check the parameters */
  assert_param(IS_TIM1_FORCED_ACTION_OK(TIM1_ForcedAction));

