2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
  /* Set or Reset the CC2P Bit */
  if (TIM1_OCPolarity != TIM1_OCPOLARITY_HIGH) {
    TIM1->CCER1 |= TIM1_CCER1_CC2P;
  } else {
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2P);
  }
}

/**
 * @brief  Configures the TIM1 Channel 2N polarity.
 * @param   TIM1_OCNPolarity specifies the OC2N Polarity.
 * This parameter can be one of the following values:
 *                       - TIM1_OCNPOLARITY_LOW: Output Compare active low
 *                       - TIM1_OCNPOLARITY_HIGH: Output Compare active high
 * @retval None
 */
inline void
TIM1_OC2NPolarityConfig_inline(TIM1_OCNPolarity_TypeDef TIM1_OCNPolarity) {
  /* Check the parameters */
  assert_param(IS_TIM1_OCN_POLARITY_OK(TIM1_OCNPolarity));

  /* Set or Reset the CC3P Bit */
  if (TIM1_OCNPolarity != TIM1_OCNPOLARITY_HIGH) {
    TIM1->CCER1 |= TIM1_CCER1_CC2NP;
  } else {
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2NP);
  }
}

/**
 * @brief  Configures the TIM1 Channel 3 polarity.
 * @param   TIM1_OCPolarity specifies the OC3 Polarity.
 * This parameter can be one of the following values:
 *                       - TIM1_OCPOLARITY_LOW: Output Compare active low
 *                       - TIM1_OCPOLARITY_HIGH: Output Compare active high
 * @retval None
 */
inline void
TIM1_OC3PolarityConfig_inline(TIM1_OCPolarity_TypeDef TIM1_OCPolarity) {
  /* Check the parameters */
  assert_param(IS_TIM1_OC_POLARITY_OK(TIM1_OCPolarity));

  /* Set or Reset the CC3P Bit */
  if (TIM1_OCPolarity != TIM1_OCPOLARITY_HIGH) {
    TIM1->CCER2 |= TIM1_CCER2_CC3P;
  } else {
    TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC3P);
  }
}

/**
 * @brief  Configures the TIM1 Channel 3N polarity.
 * @param   TIM1_OCNPolarity specifies the OC3N Polarity.
 * This parameter can be one of the following values:
 *                       - TIM1_OCNPOLARITY_LOW: Output Compare active low
 *                       - TIM1_OCNPOLARITY_HIGH: Output Compare active high
 * @retval None
 */
inline void
TIM1_OC3NPolarityConfig_inline(TIM1_OCNPolarity_TypeDef TIM1_OCNPolarity) {
  /* Check the parameters */
  assert_param(IS_TIM1_OCN_POLARITY_OK(TIM1_OCNPolarity));

  /* Set or Reset the CC3P Bit */
  if (TIM1_OCNPolarity != TIM1_OCNPOLARITY_HIGH) {
    TIM1->CCER2 |= TIM1_CCER2_CC3NP;
  } else {
    TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC3NP);
  }
}

/**
 * @brief  Configures the TIM1 Channel 4 polarity.
 * @param   TIM1_OCPolarity specifies the OC4 Polarity.
 * This parameter can be one of the following values:
 *                       - TIM1_OCPOLARITY_LOW: Output Compare active low
 *                       - TIM1_OCPOLARITY_HIGH: Output Compare active high
 * @retval None
 */
inline void
TIM1_OC4PolarityConfig_inline(TIM1_OCPolarity_TypeDef TIM1_OCPolarity) {
  /* Check the parameters */
  assert_param(IS_TIM1_OC_POLARITY_OK(TIM1_OCPolarity));

  /* Set or Reset the CC4P Bit */
  if (TIM1_OCPolarity != TIM1_OCPOLARITY_HIGH) {
    TIM1->CCER2 |= TIM1_CCER2_CC4P;
  } else {
    TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC4P);
  }
}

/**
 * @brief  Enables or disables the TIM1 Capture Compare Channel x (x=1,..,4).
 * @param   TIM1_Channel specifies the TIM1 Channel.
 * This parameter can be one of the following values:
 *                       - TIM1_CHANNEL_1: TIM1 Channel1
 *                       - TIM1_CHANNEL_2: TIM1 Channel2
 *                       - TIM1_CHANNEL_3: TIM1 Channel3
 *                       - TIM1_CHANNEL_4: TIM1 Channel4
 * @param   NewState specifies the TIM1 Channel CCxE bit new state.
 * This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
inline void TIM1_CCxCmd_inline(TIM1_Channel_TypeDef TIM1_Channel,
                               FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_TIM1_CHANNEL_OK(TIM1_Channel));
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (TIM1_Channel == TIM1_CHANNEL_1) {
    /* Set or Reset the CC1E Bit */
    if (NewState != DISABLE) {
      TIM1->CCER1 |= TIM1_CCER1_CC1E;
    } else {
      TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC1E);
    }

  } else if (TIM1_Channel == TIM1_CHANNEL_2) {
    /* Set or Reset the CC2E Bit */
    if (NewState != DISABLE) {
      TIM1->CCER1 |= TIM1_CCER1_CC2E;
    } else {
      TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2E);
    }
  } else if (TIM1_Channel == TIM1_CHANNEL_3) {
    /* Set or Reset the CC3E Bit */
    if (NewState != DISABLE) {
      TIM1->CCER2 |= TIM1_CCER2_CC3E;
    } else {
      TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC3E);
    }
  } else {
    /* Set or Reset the CC4E Bit */
    if (NewState != DISABLE) {
      TIM1->CCER2 |= TIM1_CCER2_CC4E;
    } else {
      TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC4E);
    }
  }
}

/**
 * @brief  Enables or disables the TIM1 Capture Compare Channel xN (xN=1,..,3).
 * @param   TIM1_Channel specifies the TIM1 Channel.
 * This parameter can be one of the following values:
 *                       - TIM1_CHANNEL_1: TIM1 Channel1
 *                       - TIM1_CHANNEL_2: TIM1 Channel2
 *                       - TIM1_CHANNEL_3: TIM1 Channel3
 * @param   NewState specifies the TIM1 Channel CCxNE bit new state.
 * This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
inline void TIM1_CCxNCmd_inline(TIM1_Channel_TypeDef TIM1_Channel,
                                FunctionalState NewState) {
  /* Check the parameters */
  assert_param(IS_TIM1_COMPLEMENTARY_CHANNEL_OK(TIM1_Channel));
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (TIM1_Channel == TIM1_CHANNEL_1) {
    /* Set or Reset the CC1NE Bit */
    if (NewState != DISABLE) {
      TIM1->CCER1 |= TIM1_CCER1_CC1NE;
    } else {
      TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC1NE);
    }
  } else if (TIM1_Channel == TIM1_CHANNEL_2) {
    /* Set or Reset the CC2NE Bit */
    if (NewState != DISABLE) {
      TIM1->CCER1 |= TIM1_CCER1_CC2NE;
    } else {
      TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2NE);
    }
  } else {
    /* Set or Reset the CC3NE Bit */
    if (NewState != DISABLE) {
      TIM1->CCER2 |= TIM1_CCER2_CC3NE;
    } else {
      TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC3NE);
    }
  }
}

/**
 * @brief  Selects the TIM1 Output Compare Mode. This function disables the
 * selected channel before changing the Output Compare Mode. User has to
 * enable this channel using TIM1_CCxCmd and TIM1_CCxNCmd functions.
 * @param   TIM1_Channel specifies the TIM1 Channel.
 * This parameter can be one of the following values:
 *                       - TIM1_CHANNEL_1: TIM1 Channel1
 *                       - TIM1_CHANNEL_2: TIM1 Channel2
 *                       - TIM1_CHANNEL_3: TIM1 Channel3
 *                       - TIM1_CHANNEL_4: TIM1 Channel4
 * @param   TIM1_OCMode specifies the TIM1 Output Compare Mode.
 * This parameter can be one of the following values:
 *                       - TIM1_OCMODE_TIMING
 *                       - TIM1_OCMODE_ACTIVE
 *                       - TIM1_OCMODE_TOGGLE
 *                       - TIM1_OCMODE_PWM1
 *                       - TIM1_OCMODE_PWM2
 *                       - TIM1_FORCEDACTION_ACTIVE
 *                       - TIM1_FORCEDACTION_INACTIVE
 * @retval None
 */
inline void TIM1_SelectOCxM_inline(TIM1_Channel_TypeDef TIM1_Channel,
                                   TIM1_OCMode_TypeDef TIM1_OCMode) {
  /* Check the parameters */
  assert_param(IS_TIM1_CHANNEL_OK(TIM1_Channel));
  assert_param(IS_TIM1_OCM_OK(TIM1_OCMode));

