2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
  if (TIM1_Channel == TIM1_CHANNEL_1) {
    /* Disable the Channel 1: Reset the CCE Bit */
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC1E);

    /* Reset the Output Compare Bits & Set the Output Compare Mode */
    TIM1->CCMR1 = (uint8_t)((uint8_t)(TIM1->CCMR1 & (uint8_t)(~TIM1_CCMR_OCM)) |
                            (uint8_t)TIM1_OCMode);
  } else if (TIM1_Channel == TIM1_CHANNEL_2) {
    /* Disable the Channel 2: Reset the CCE Bit */
    TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC2E);

    /* Reset the Output Compare Bits & Set the Output Compare Mode */
    TIM1->CCMR2 = (uint8_t)((uint8_t)(TIM1->CCMR2 & (uint8_t)(~TIM1_CCMR_OCM)) |
                            (uint8_t)TIM1_OCMode);
  } else if (TIM1_Channel == TIM1_CHANNEL_3) {
    /* Disable the Channel 3: Reset the CCE Bit */
    TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC3E);

    /* Reset the Output Compare Bits & Set the Output Compare Mode */
    TIM1->CCMR3 = (uint8_t)((uint8_t)(TIM1->CCMR3 & (uint8_t)(~TIM1_CCMR_OCM)) |
                            (uint8_t)TIM1_OCMode);
  } else {
    /* Disable the Channel 4: Reset the CCE Bit */
    TIM1->CCER2 &= (uint8_t)(~TIM1_CCER2_CC4E);

    /* Reset the Output Compare Bits & Set the Output Compare Mode */
    TIM1->CCMR4 = (uint8_t)((uint8_t)(TIM1->CCMR4 & (uint8_t)(~TIM1_CCMR_OCM)) |
                            (uint8_t)TIM1_OCMode);
  }
}

/**
 * @brief  Sets the TIM1 Counter Register value.
 * @param   Counter specifies the Counter register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM1_SetCounter_inline(uint16_t Counter) {
  /* Set the Counter Register value */
  TIM1->CNTRH = (uint8_t)(Counter >> 8);
  TIM1->CNTRL = (uint8_t)(Counter);
}

/**
 * @brief  Sets the TIM1 Autoreload Register value.
 * @param   Autoreload specifies the Autoreload register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM1_SetAutoreload_inline(uint16_t Autoreload) {
  /* Set the Autoreload Register value */
  TIM1->ARRH = (uint8_t)(Autoreload >> 8);
  TIM1->ARRL = (uint8_t)(Autoreload);
}

/**
 * @brief  Sets the TIM1 Capture Compare1 Register value.
 * @param   Compare1 specifies the Capture Compare1 register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM1_SetCompare1_inline(uint16_t Compare1) {
  /* Set the Capture Compare1 Register value */
  TIM1->CCR1H = (uint8_t)(Compare1 >> 8);
  TIM1->CCR1L = (uint8_t)(Compare1);
}

/**
 * @brief  Sets the TIM1 Capture Compare2 Register value.
 * @param   Compare2 specifies the Capture Compare2 register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM1_SetCompare2_inline(uint16_t Compare2) {
  /* Set the Capture Compare2 Register value */
  TIM1->CCR2H = (uint8_t)(Compare2 >> 8);
  TIM1->CCR2L = (uint8_t)(Compare2);
}

/**
 * @brief  Sets the TIM1 Capture Compare3 Register value.
 * @param   Compare3 specifies the Capture Compare3 register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM1_SetCompare3_inline(uint16_t Compare3) {
  /* Set the Capture Compare3 Register value */
  TIM1->CCR3H = (uint8_t)(Compare3 >> 8);
  TIM1->CCR3L = (uint8_t)(Compare3);
}

/**
 * @brief  Sets the TIM1 Capture Compare4 Register value.
 * @param   Compare4 specifies the Capture Compare4 register new value.
 * This parameter is between 0x0000 and 0xFFFF.
 * @retval None
 */
inline void TIM1_SetCompare4_inline(uint16_t Compare4) {
  /* Set the Capture Compare4 Register value */
  TIM1->CCR4H = (uint8_t)(Compare4 >> 8);
  TIM1->CCR4L = (uint8_t)(Compare4);
}

/**
 * @brief  Sets the TIM1 Input Capture 1 prescaler.
 * @param   TIM1_IC1Prescaler specifies the Input Capture prescaler new value
 * This parameter can be one of the following values:
 *                       - TIM1_ICPSC_DIV1: no prescaler
 *                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
 *                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
 *                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
 * @retval None
 */
inline void TIM1_SetIC1Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC1Prescaler) {
  /* Check the parameters */
  assert_param(IS_TIM1_IC_PRESCALER_OK(TIM1_IC1Prescaler));

  /* Reset the IC1PSC Bits */ /* Set the IC1PSC value */
  TIM1->CCMR1 =
      (uint8_t)((uint8_t)(TIM1->CCMR1 & (uint8_t)(~TIM1_CCMR_ICxPSC)) |
                (uint8_t)TIM1_IC1Prescaler);
}

/**
 * @brief  Sets the TIM1 Input Capture 2 prescaler.
 * @param   TIM1_IC2Prescaler specifies the Input Capture prescaler new value
 * This parameter can be one of the following values:
 *                       - TIM1_ICPSC_DIV1: no prescaler
 *                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
 *                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
 *                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
 * @retval None
 */
inline void TIM1_SetIC2Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC2Prescaler) {

  /* Check the parameters */
  assert_param(IS_TIM1_IC_PRESCALER_OK(TIM1_IC2Prescaler));

  /* Reset the IC1PSC Bits */ /* Set the IC1PSC value */
  TIM1->CCMR2 =
      (uint8_t)((uint8_t)(TIM1->CCMR2 & (uint8_t)(~TIM1_CCMR_ICxPSC)) |
                (uint8_t)TIM1_IC2Prescaler);
}

/**
 * @brief  Sets the TIM1 Input Capture 3 prescaler.
 * @param   TIM1_IC3Prescaler specifies the Input Capture prescaler new value
 * This parameter can be one of the following values:
 *                       - TIM1_ICPSC_DIV1: no prescaler
 *                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
 *                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
 *                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
 * @retval None
 */
inline void TIM1_SetIC3Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC3Prescaler) {

  /* Check the parameters */
  assert_param(IS_TIM1_IC_PRESCALER_OK(TIM1_IC3Prescaler));

  /* Reset the IC1PSC Bits & Set the IC1PSC value */
  TIM1->CCMR3 =
      (uint8_t)((uint8_t)(TIM1->CCMR3 & (uint8_t)(~TIM1_CCMR_ICxPSC)) |
                (uint8_t)TIM1_IC3Prescaler);
}

/**
 * @brief  Sets the TIM1 Input Capture 4 prescaler.
 * @param  TIM1_IC4Prescaler specifies the Input Capture prescaler new value
 *         This parameter can be one of the following values:
 *                       - TIM1_ICPSC_DIV1: no prescaler
 *                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
 *                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
 *                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
 * @retval None
 */
inline void TIM1_SetIC4Prescaler_inline(TIM1_ICPSC_TypeDef TIM1_IC4Prescaler) {

  /* Check the parameters */
  assert_param(IS_TIM1_IC_PRESCALER_OK(TIM1_IC4Prescaler));

  /* Reset the IC1PSC Bits &  Set the IC1PSC value */
  TIM1->CCMR4 =
      (uint8_t)((uint8_t)(TIM1->CCMR4 & (uint8_t)(~TIM1_CCMR_ICxPSC)) |
                (uint8_t)TIM1_IC4Prescaler);
}

/**
 * @brief  Gets the TIM1 Input Capture 1 value.
 * @param  None
 * @retval Capture Compare 1 Register value.
 */
inline uint16_t TIM1_GetCapture1_inline(void) {
  /* Get the Capture 1 Register value */

  uint16_t tmpccr1 = 0;
  uint8_t tmpccr1l = 0, tmpccr1h = 0;

  tmpccr1h = TIM1->CCR1H;
  tmpccr1l = TIM1->CCR1L;

  tmpccr1 = (uint16_t)(tmpccr1l);
  tmpccr1 |= (uint16_t)((uint16_t)tmpccr1h << 8);
  /* Get the Capture 1 Register value */
  return (uint16_t)tmpccr1;
}

/**
 * @brief  Gets the TIM1 Input Capture 2 value.
 * @param  None
 * @retval Capture Compare 2 Register value.
 */
inline uint16_t TIM1_GetCapture2_inline(void) {
  /* Get the Capture 2 Register value */

  uint16_t tmpccr2 = 0;
  uint8_t tmpccr2l = 0, tmpccr2h = 0;

  tmpccr2h = TIM1->CCR2H;
  tmpccr2l = TIM1->CCR2L;

  tmpccr2 = (uint16_t)(tmpccr2l);
  tmpccr2 |= (uint16_t)((uint16_t)tmpccr2h << 8);
  /* Get the Capture 2 Register value */
  return (uint16_t)tmpccr2;
}

/**
 * @brief  Gets the TIM1 Input Capture 3 value.
 * @param  None
 * @retval Capture Compare 3 Register value.
 */
inline uint16_t TIM1_GetCapture3_inline(void) {
  /* Get the Capture 3 Register value */
  uint16_t tmpccr3 = 0;
  uint8_t tmpccr3l = 0, tmpccr3h = 0;

  tmpccr3h = TIM1->CCR3H;
  tmpccr3l = TIM1->CCR3L;

  tmpccr3 = (uint16_t)(tmpccr3l);
  tmpccr3 |= (uint16_t)((uint16_t)tmpccr3h << 8);
  /* Get the Capture 3 Register value */
  return (uint16_t)tmpccr3;
}

/**
 * @brief  Gets the TIM1 Input Capture 4 value.
 * @param  None
 * @retval Capture Compare 4 Register value.
 */
inline uint16_t TIM1_GetCapture4_inline(void) {
  /* Get the Capture 4 Register value */
  uint16_t tmpccr4 = 0;
  uint8_t tmpccr4l = 0, tmpccr4h = 0;

