2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_tim1_inline.h
  tmpccr4h = TIM1->CCR4H;
  tmpccr4l = TIM1->CCR4L;

  tmpccr4 = (uint16_t)(tmpccr4l);
  tmpccr4 |= (uint16_t)((uint16_t)tmpccr4h << 8);
  /* Get the Capture 4 Register value */
  return (uint16_t)tmpccr4;
}

/**
 * @brief  Gets the TIM1 Counter value.
 * @param  None
 * @retval Counter Register value.
 */
inline uint16_t TIM1_GetCounter_inline(void) {
  uint16_t tmpcntr = 0;

  tmpcntr = ((uint16_t)TIM1->CNTRH << 8);

  /* Get the Counter Register value */
  return (uint16_t)(tmpcntr | (uint16_t)(TIM1->CNTRL));
}

/**
 * @brief  Gets the TIM1 Prescaler value.
 * @param  None
 * @retval Prescaler Register value.
 */
inline uint16_t TIM1_GetPrescaler_inline(void) {
  uint16_t temp = 0;

  temp = ((uint16_t)TIM1->PSCRH << 8);

  /* Get the Prescaler Register value */
  return (uint16_t)(temp | (uint16_t)(TIM1->PSCRL));
}

/**
 * @brief  Checks whether the specified TIM1 flag is set or not.
 * @param  TIM1_FLAG specifies the flag to check.
 *         This parameter can be one of the following values:
 *                   - TIM1_FLAG_UPDATE: TIM1 update Flag
 *                   - TIM1_FLAG_CC1: TIM1 Capture Compare 1 Flag
 *                   - TIM1_FLAG_CC2: TIM1 Capture Compare 2 Flag
 *                   - TIM1_FLAG_CC3: TIM1 Capture Compare 3 Flag
 *                   - TIM1_FLAG_CC4: TIM1 Capture Compare 4 Flag
 *                   - TIM1_FLAG_COM: TIM1 Commutation Flag
 *                   - TIM1_FLAG_TRIGGER: TIM1 Trigger Flag
 *                   - TIM1_FLAG_BREAK: TIM1 Break Flag
 *                   - TIM1_FLAG_CC1OF: TIM1 Capture Compare 1 overcapture Flag
 *                   - TIM1_FLAG_CC2OF: TIM1 Capture Compare 2 overcapture Flag
 *                   - TIM1_FLAG_CC3OF: TIM1 Capture Compare 3 overcapture Flag
 *                   - TIM1_FLAG_CC4OF: TIM1 Capture Compare 4 overcapture Flag
 * @retval FlagStatus The new state of TIM1_FLAG (SET or RESET).
 */
inline FlagStatus TIM1_GetFlagStatus_inline(TIM1_FLAG_TypeDef TIM1_FLAG) {
  FlagStatus bitstatus = RESET;
  uint8_t tim1_flag_l = 0, tim1_flag_h = 0;

  /* Check the parameters */
  assert_param(IS_TIM1_GET_FLAG_OK(TIM1_FLAG));

  tim1_flag_l = (uint8_t)(TIM1->SR1 & (uint8_t)TIM1_FLAG);
  tim1_flag_h = (uint8_t)((uint16_t)TIM1_FLAG >> 8);

  if ((tim1_flag_l | (uint8_t)(TIM1->SR2 & tim1_flag_h)) != 0) {
    bitstatus = SET;
  } else {
    bitstatus = RESET;
  }
  return (FlagStatus)(bitstatus);
}

/**
 * @brief  Clears the TIM1’s pending flags.
 * @param  TIM1_FLAG specifies the flag to clear.
 *         This parameter can be one of the following values:
 *                       - TIM1_FLAG_UPDATE: TIM1 update Flag
 *                       - TIM1_FLAG_CC1: TIM1 Capture Compare 1 Flag
 *                       - TIM1_FLAG_CC2: TIM1 Capture Compare 2 Flag
 *                       - TIM1_FLAG_CC3: TIM1 Capture Compare 3 Flag
 *                       - TIM1_FLAG_CC4: TIM1 Capture Compare 4 Flag
 *                       - TIM1_FLAG_COM: TIM1 Commutation Flag
 *                       - TIM1_FLAG_TRIGGER: TIM1 Trigger Flag
 *                       - TIM1_FLAG_BREAK: TIM1 Break Flag
 *                       - TIM1_FLAG_CC1OF: TIM1 Capture Compare 1 overcapture
 * Flag
 *                       - TIM1_FLAG_CC2OF: TIM1 Capture Compare 2 overcapture
 * Flag
 *                       - TIM1_FLAG_CC3OF: TIM1 Capture Compare 3 overcapture
 * Flag
 *                       - TIM1_FLAG_CC4OF: TIM1 Capture Compare 4 overcapture
 * Flag
 * @retval None.
 */
inline void TIM1_ClearFlag_inline(TIM1_FLAG_TypeDef TIM1_FLAG) {
  /* Check the parameters */
  assert_param(IS_TIM1_CLEAR_FLAG_OK(TIM1_FLAG));

  /* Clear the flags (rc_w0) clear this bit by writing 0. Writing ‘1’ has no
   * effect*/
  TIM1->SR1 = (uint8_t)(~(uint8_t)(TIM1_FLAG));
  TIM1->SR2 = (uint8_t)((uint8_t)(~((uint8_t)((uint16_t)TIM1_FLAG >> 8))) &
                        (uint8_t)0x1E);
}

/**
 * @brief  Checks whether the TIM1 interrupt has occurred or not.
 * @param  TIM1_IT specifies the TIM1 interrupt source to check.
 *         This parameter can be one of the following values:
 *                       - TIM1_IT_UPDATE: TIM1 update Interrupt source
 *                       - TIM1_IT_CC1: TIM1 Capture Compare 1 Interrupt source
 *                       - TIM1_IT_CC2: TIM1 Capture Compare 2 Interrupt source
 *                       - TIM1_IT_CC3: TIM1 Capture Compare 3 Interrupt source
 *                       - TIM1_IT_CC4: TIM1 Capture Compare 4 Interrupt source
 *                       - TIM1_IT_COM: TIM1 Commutation Interrupt source
 *                       - TIM1_IT_TRIGGER: TIM1 Trigger Interrupt source
 *                       - TIM1_IT_BREAK: TIM1 Break Interrupt source
 * @retval ITStatus The new state of the TIM1_IT(SET or RESET).
 */
inline ITStatus TIM1_GetITStatus_inline(TIM1_IT_TypeDef TIM1_IT) {
  ITStatus bitstatus = RESET;
  uint8_t TIM1_itStatus = 0, TIM1_itEnable = 0;

  /* Check the parameters */
  assert_param(IS_TIM1_GET_IT_OK(TIM1_IT));

  TIM1_itStatus = (uint8_t)(TIM1->SR1 & (uint8_t)TIM1_IT);

  TIM1_itEnable = (uint8_t)(TIM1->IER & (uint8_t)TIM1_IT);

  if ((TIM1_itStatus != (uint8_t)RESET) && (TIM1_itEnable != (uint8_t)RESET)) {
    bitstatus = SET;
  } else {
    bitstatus = RESET;
  }
  return (ITStatus)(bitstatus);
}

/**
 * @brief  Clears the TIM1's interrupt pending bits.
 * @param  TIM1_IT specifies the pending bit to clear.
 *         This parameter can be one of the following values:
 *                       - TIM1_IT_UPDATE: TIM1 update Interrupt source
 *                       - TIM1_IT_CC1: TIM1 Capture Compare 1 Interrupt source
 *                       - TIM1_IT_CC2: TIM1 Capture Compare 2 Interrupt source
 *                       - TIM1_IT_CC3: TIM1 Capture Compare 3 Interrupt source
 *                       - TIM1_IT_CC4: TIM1 Capture Compare 4 Interrupt source
 *                       - TIM1_IT_COM: TIM1 Commutation Interrupt source
 *                       - TIM1_IT_TRIGGER: TIM1 Trigger Interrupt source
 *                       - TIM1_IT_BREAK: TIM1 Break Interrupt source
 * @retval None.
 */
inline void TIM1_ClearITPendingBit_inline(TIM1_IT_TypeDef TIM1_IT) {
  /* Check the parameters */
  assert_param(IS_TIM1_IT_OK(TIM1_IT));

  /* Clear the IT pending Bit */
  TIM1->SR1 = (uint8_t)(~(uint8_t)TIM1_IT);
}

#endif
